let ErrorCode= {
  0: " 成功",
  1: " 未知错误",
  2: " 数据库错误",

  // 发验证码
  3: " 刚发过确认码，还未超时",
  // 登录注册
  4: " 验证超时",
  5: " 验证码失效",
  // 谷歌验证
  6: " 谷歌验证失败",
  7: " 密码错误",
  8: " 验证码错误",
  9: " 有别的设备已登录",

  // 下单
  10: " 下单给自己",
  11: " 卖家(对方)电子币不足",
  12: " 没有这条发布信息",
  13: " 买家(对方)有订单未完成",
  14: " 当天取消订单超过5次",
  15: " 对方当天取消订单超过5次",
  16: " 只有买家可以取消订单",
  17: " 买家(你自己)电子币不足",
  18: " 买家(你自己)有订单未完成",
  19: " 重建订单 广告已下架",

  // 发布广告
  20: " 发布出售,电子币不足",
  21: " 最多可同时发布3条广告",
  22: " 一个币种同时只能上架一条广告",
  23: " 广告金额不合规",
  24: " 大额认证无效",

  // 提币
  31: " 钱包余额小于0",
  32: " 钱包金额不足",
  33: " 小于提币限额",
  // 评价
  41: " 无此订单",
  42: " 双方已评价",
  43: " 订单未完成",
  44: " 卖家ID错误",
  45: " 买家已评价",
  46: " 买家ID错误",
  47: " 卖家已评价",
  48: " 不是你的订单",
  240: " 评论已删除",
  241: " 评论已超时不可删除",

  // 担保转账
  50: " 下单给自己",
  51: " 不是买家也不是卖家",
  52: " 电子币不足",
  53: " 有未完成的担保转账",
  54: " 只有接收方可以取消",
  55: " 状态不匹配",
  56: " 担保转账已超时",

  // 转账
  60: " 下单给自己",
  61: " 电子币不足",
  62: " 不是转给你的",
  63: " 状态无效",
  64: " 超时,24小时",
// 红包
  71: " 电子币不足",
  72: " 超过24小时",
  73: " 不是组成员",
  74: " 红包领完",
  75: " 已经领过红包",

  // 钱包
  80: " 收款地址已满",
  81: " 收款地址不存在",

  // 其他
  90: " 不能信任自己",
  91: " 新旧密码相同",
  92: " 密码为空",
  93: " 名字已占用",
  94: " 已经是好友了",
  95: " 不能踢出群主",
  96: " 不是你的申诉",
  97: " 同类型的钱包数量超过1个",
  98: " 下单时对方改变价格",
  99: " 广告可交易量不足",

  // 身份认证
  100: " 身份认证失败超过3次",
  101: " 正在审核中",
  102: " 身份认证状态不识别",
  103: " 身份认证已经通过",
  104: " 身份认证状态不是待审核不能修改",
  105: " 身份认证记录不存在",
  106: " 恶意上传，关闭上传功能三天",

  // 客服
  110: " 非管理员",
  111: " 已完成仲裁",
  112: " 申诉已撤回",
  113: " 未指定责任人",
  114: " 申诉状态不匹配",
  115: " 需付款三十分钟后才可申诉",

  //
  200: "参数不正确",
};

export default ErrorCode;
